---
kind: other
id: Properties.T:Autodesk.Revit.UI.Macros.UIMacroManager
source: html/a4b7b941-a301-262d-8f5f-91f36c5c2b53.htm
---
# UIMacroManager Properties

Specifies whether the .NET object represents a valid Revit entity.